beauty-of-programming/1-game.org
#+TITLE:     第1章 游戏之乐
#+AUTHOR:    马楠（nxmanan#gmail.com）
#+EMAIL:     nxmanan#gmail.com
#+DATE:      2014-11-10
#+DESCRIPTION: 编程之美笔记
#+KEYWORDS: Algorithm
#+LANGUAGE: en
#+OPTIONS: H:3 num:nil toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS: TeX:t LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS: ^:{} #不对下划线_进行直接转义
#+INFOJS_OPT: view:nil toc: ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: no-export
#+HTML_LINK_HOME: http://manan.org
#+HTML_LINK_UP: ./index.html
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./style/emacs.css" />

* 1.1 CPU曲线
进程空循环时占用CPU，sleep时CPU空闲。通过循环控制CPU的使用率，使CPU占用曲线变化。

* 1.2 中国象棋将帅问题
- 位操作
  + 用位操作在一个字节上表示两个变量
- 位域的概念（TCPL）
  + 一个结构体里，每个变量用若干位数表示，而不是整个变量，节省空间

* 1.3 烙饼排序
递归遍历所有的排序方法，不断更新上界。

用下界来剪枝，排除大量冗余方案。

* 1.4 买书问题
动态规划，在若干个子问题中选最优，递归解子问题。

* 1.5 快速找出故障机器
一台机器：异或一遍。

两台机器：异或后，根据结果把所有机器分成两类，回到一台机器的问题。

* 1.9 高效地安排会面
最小着色问题。
** 面试点数量
区间图，不断增加颜色数量到满足需要的值为止。

* 1.10 双线程高效下载
线程，信号量，锁。

* 1.14 连连看游戏设计
- 游戏局面的状态描述：自动机。
- 找最短路径（判断是否可消除）：广度优先搜索，从转弯数少的点向远处扩展
  + 记录父节点，就可以回溯路径

* 1.16 24点游戏
- 解法一：穷举，每次取两个元素出来，计算出可能结果放回集合，进行递归，计算出结果就返回。
- 解法二：定义两个集合的Fork运算，计算它们可能的组合结果。计算冗余量比一小，但无法得到算式。
